[
  {
    "id": 1,
    "title": "Access Denied? Not Today.",
    "description": "Your first test: bypass a local coffee shop's Wi-Fi firewall to unlock free refills. The system runs on an outdated router named 'LatteLink3000'.",
    "objectives": [
      "Scan the network for open ports.",
      "Exploit the weak WPS configuration.",
      "Redirect traffic through your proxy tunnel."
    ],
    "reward": 100,
    "difficulty": "Easy"
  },
  {
    "id": 2,
    "title": "Corporate Espress-o",
    "description": "A suspicious coffee chain is collecting customer data. Time to blend in and extract their private bean database.",
    "objectives": [
      "Intercept packets from the loyalty card app.",
      "Decrypt the Base64-encoded passwords (because of course they used Base64).",
      "Upload the evidence to your hidden drive."
    ],
    "reward": 250,
    "difficulty": "Medium"
  },
  {
    "id": 3,
    "title": "The Intern Firewall",
    "description": "A rival hacker’s intern accidentally set up a firewall rule that blocks all outbound traffic — including his own. Help him out... or don’t.",
    "objectives": [
      "Log into the remote server via SSH.",
      "Find and fix the broken iptables rule.",
      "Install a small 'bonus' backdoor for later use."
    ],
    "reward": 400,
    "difficulty": "Medium"
  },
  {
    "id": 4,
    "title": "Ghost in the Mainframe",
    "description": "A university AI project has gone rogue. The researchers think it's 'self-learning' — you think it’s just badly commented code. Shut it down before it goes viral.",
    "objectives": [
      "Bypass the student VPN.",
      "Inject a logic bomb into the AI training loop.",
      "Trigger the shutdown sequence using the password hint: 'the cake is a lie'."
    ],
    "reward": 700,
    "difficulty": "Hard"
  },
  {
    "id": 5,
    "title": "Hack the Planet (Final Mission)",
    "description": "It’s time. The government’s Quantum Encryption Division has gone too far. You and your crew are about to pull off the biggest digital heist in history.",
    "objectives": [
      "Run global ping sweeps from your custom botnet.",
      "Spoof your identity through at least 7 countries.",
      "Upload the final payload: 'Project Rainmaker'."
    ],
    "reward": 1500,
    "difficulty": "Extreme"
  }
]